In [75]:
import numpy as np
import pandas as pd

In [76]:
date = pd.read_csv('../11.1 DATA/orders.csv')
time = pd.read_csv('../11.1 DATA/messages.csv')

In [77]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [78]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [79]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [80]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [81]:
# Here both date columns are object type
# So we need to convert them into datetime type

### **Working with Dates**

In [82]:
# Converting to datetime dtype
date['date'] = pd.to_datetime(date['date'])

In [83]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [84]:
date.sample()

          date  product_id  city_id  orders
334 2019-10-27        1130       14      48

#### 1. Extract year

In [85]:
date['date_year'] = date['date'].dt.year

In [86]:
date.sample()

          date  product_id  city_id  orders  date_year
813 2019-06-12          12       25       1       2019

#### 2. Extract month

In [87]:
date['date_month'] = date['date'].dt.month

In [88]:
date.sample()

          date  product_id  city_id  orders  date_year  date_month
798 2018-07-23         154       26       4       2018           7

#### 3. Extract day

In [89]:
date['date_day'] = date['date'].dt.day

In [90]:
date.sample()

          date  product_id  city_id  orders  date_year  date_month  date_day
834 2018-07-27         398       22       8       2018           7        27

#### 4. Days of week

In [91]:
date['date_dow'] = date['date'].dt.dayofweek
date.sample()

,date,product_id,city_id,orders,date_year,date_month,date_day,date_dow
815,2019-12-08,3659,20,4,2019,12,8,6

#### 5. Days of week name

In [92]:
date['date_down'] = date['date'].dt.day_name()
date.sample()

,date,product_id,city_id,orders,date_year,date_month,date_day,date_dow,date_down
268,2018-11-14,6642,4,1,2018,11,14,2,Wednesday

#### 6. is Weekend?

In [93]:
date['date_is_weekend'] = np.where(date['date_down'].isin(['saturday','sunday']),1,0)
date.sample()

,date,product_id,city_id,orders,date_year,date_month,date_day,date_dow,date_down,date_is_weekend
472,2019-11-05,7464,0,3,2019,11,5,1,Tuesday,0

#### 7. Extract week of the year

In [104]:
date['date_week'] = date['date'].dt.isocalendar().week
date.sample()

,date,product_id,city_id,orders,date_year,date_month,date_day,date_dow,date_down,date_is_weekend,date_week
598,2018-09-07,1134,13,19,2018,9,7,4,Friday,0,36

#### 8. Extract quarter

In [107]:
date['quarter'] = date['date'].dt.quarter
date.sample()

,date,product_id,city_id,orders,date_year,date_month,date_day,date_dow,date_down,date_is_weekend,date_week,quarter
746,2019-02-01,6632,22,5,2019,2,1,4,Friday,0,5,1

#### 9. Extract semester

In [108]:
date['semester'] = np.where(date['quarter'].isin([1,2]),1,2)
date.sample()

,date,product_id,city_id,orders,date_year,date_month,date_day,date_dow,date_down,date_is_weekend,date_week,quarter,semester
188,2019-06-25,1123,25,1,2019,6,25,1,Tuesday,0,26,2,1

## **Extratct time elapsed between dates**

In [109]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 12, 30, 18, 23, 39, 718935)

In [111]:
# Date difference till today
date['diff'] = today - date['date']
date.sample()

,date,product_id,city_id,orders,date_year,date_month,date_day,date_dow,date_down,date_is_weekend,date_week,quarter,semester,diff
591,2019-10-15,5386,25,2,2019,10,15,1,Tuesday,0,42,4,2,2268 days 18:23:39.718935

In [114]:
# only dates required in that
(today - date['date']).dt.days

0      2212
1      2694
2      2625
3      2327
4      2550
       ...
995    2640
996    2581
997    2429
998    2494
999    2268
Name: date, Length: 1000, dtype: int64

In [156]:
# Month passed
np.round((today - date['date'])/np.timedelta64(1,'m'),1)

0      3186383.7
1      3880463.7
2      3781103.7
3      3351983.7
4      3673103.7
         ...
995    3802703.7
996    3717743.7
997    3498863.7
998    3592463.7
999    3267023.7
Name: date, Length: 1000, dtype: float64

### **Working with Time**

In [123]:
time['date'] = pd.to_datetime(time['date'])

In [124]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [125]:
time.sample()

                   date                                                msg
977 2013-08-21 23:33:00  МУЖЧИНА 40 ПОЗНАКОМЛЮСЬ С СЕМЕЙНОЙ ПАРОЙ 09339...

In [127]:
time['hour'] = time['date'].dt.hour
time.sample()

,date,msg,hour
130,2015-11-12 01:08:00,Классный п 23) подружусь с девушкой 063 373 2678,1

In [128]:
time['min'] = time['date'].dt.minute
time.sample()

                   date                               msg  hour  min
818 2014-10-26 00:48:00  пар ищет парня сейчас 0980907068     0   48

In [146]:
time['sec'] = time['date'].dt.second
time.sample()

                   date                                  msg  hour  min  sec
568 2014-06-25 22:55:00  ИЩЮ ДЕВУШКУ С Ч\\Ю П.25Л 0993041437    22   55    0

#### Extract Time part from datetime in date column

In [148]:
time['time'] = time['date'].dt.time
time.sample()

,date,msg,hour,min,sec,time
804,2015-09-26 23:22:00,Познакомлюсь с женщиной для не частых встреч. ...,23,22,0,23:22:00

#### Time Difference

In [149]:
today - time['date']

0     4398 days 17:33:39.718935
1     4262 days 18:43:39.718935
2     4748 days 18:02:39.718935
3     4050 days 17:52:39.718935
4     4447 days 19:12:39.718935
                 ...
995   5037 days 17:33:39.718935
996   4358 days 19:09:39.718935
997   4823 days 18:46:39.718935
998   4939 days 18:49:39.718935
999   4211 days 18:58:39.718935
Name: date, Length: 1000, dtype: timedelta64[ns]

In [157]:
(today - time['date'])/np.timedelta64(1,'m')

0      6.334174e+06
1      6.138404e+06
2      6.838203e+06
3      5.833073e+06
4      6.404833e+06
           ...
995    7.254334e+06
996    6.276670e+06
997    6.946247e+06
998    7.113290e+06
999    6.064979e+06
Name: date, Length: 1000, dtype: float64

In [158]:
# in seconds
(today - time['date'])/np.timedelta64(1,'s')

0      3.800504e+08
1      3.683042e+08
2      4.102922e+08
3      3.499844e+08
4      3.842900e+08
           ...
995    4.352600e+08
996    3.766002e+08
997    4.167748e+08
998    4.267974e+08
999    3.638987e+08
Name: date, Length: 1000, dtype: float64

In [160]:
# in hours
(today - time['date'])/np.timedelta64(1,'h')

0      105569.561033
1      102306.727700
2      113970.044366
3       97217.877700
4      106747.211033
           ...
995    120905.561033
996    104611.161033
997    115770.777700
998    118554.827700
999    101082.977700
Name: date, Length: 1000, dtype: float64